<template>
    <div>
        <web-header></web-header>
        <div class="main_content">
            <p v-html="comments[type]">
            </p>
        </div>
        <web-footer></web-footer>
    </div>
</template>

<script>
import WebHeader from '@/views/common/webHeader'
import WebFooter from '@/views/common/webFooter'
import {
    mapGetters
}
    from 'vuex'
export default {
    data() {
        return {
            type: '',
            comments: {
                us: '我們熱愛潮流時尚，盡全力提供給大家最潮的平價產品。 我們熱愛音樂，盡全力推廣音樂並帶給大家愉悅舒適的購物環境。 我們非常幽默，....這種話怎麼好意思自己說，也太幽默了。 本商城2015年年底開始運作，我們只做限量精選的倡導，其中的諸多精選單品在網路上好評如潮！ 我們所有產品主選貨到付款的模式，購物流程簡單，為您的購物體驗帶來前所未有的便捷體驗！ 網路上的商品種類繁多，讓客戶難以選擇，我們組建了強大的編輯團隊，全網路搜尋好慷產品，只為您而服務！ 我們的願景是：我們一直在成長，一直在努力，期許能為網路上的您帶來一站式的消費體驗，成為您必備的購物首選！ 來自社會精英的您，若有任何建議，請请不吝赐教！！',
                service: `本條款所稱「網頁內容」包括但不限本網站或透過本網站所呈現的文字、使用者界面、圖表、商標、標誌、聲音、音樂、美編、編碼、設計、架構、界面外觀……等等，以及前述事項的組合。本公司擁有、控制、或被授權使用網頁內容，網頁內容皆受到著作權、專利、商標及各類智慧財產權及公平交易法等相關法令規定的保護。<br>
                本公司不保證您所接觸的網站或網頁內容的任何部分為正確、完整或可使用，或未來將持續維持正確、完整或可使用的狀態。本公司有權利但無義務，得隨時以任何理由或毋須理由，自行決定增加、變更、修改、刪除、限制或阻擋存取本網站或網頁內容的全部或部分。<br><br>
                使用者行為<br><br>
                1. 本網站及網頁內容的使用權限僅在符合本網站及本條款載明之特定目的。任何未經事前授權的商業行為都是被禁止的。<br>
                2. 你必須遵守相關法令規範，並且對於經由使用者名稱和密碼所進行的任何行為、以及所儲存的所有資料負責。你必須同意以下的行為：<br>
                ● 不得張貼任何有關歧視、詆毀、中傷或侵權等內容的資訊。<br>
                ● 不得以任何蒐集其他使用者的憑證及濫用自己的憑證。<br>
                ● 不得偽造身份或操控識別功能，不可假冒他人或無權代表他人，或模仿其他個人或團體。<br>
                ● 不得以探試密碼或任何其它之非法手段，未經授權進入本網站或任何連結至本網站的網路的漏洞。<br>
                ● 不得違背本網站或任何連結至本網站的安全或認證機制。<br>
                ● 不得非法或未經授權之目的使用本網站。<br>
                ● 不得刪除任何網頁內容複本中的專屬權聲明。<br>
                ● 僅得將該網頁內容作為您個人非營利的參考，且不得將該網頁內容重製或張貼至已連結的電腦，或透過任何媒體播送該網頁內容。<br>
                ● 不得對該網頁內容進行任何修改；不會採取任何行為，施加不合理或不成比例之 大量資料，於本網站或系統或網路或任何連結至3C好康之網路或系統。<br>
                ● 不得對於該網頁內容為任何額外的聲明或保證。<br>
                ● 同意不使用任何設備、軟體或程序，干擾或試圖干擾本網站、於本網站進行交易之正常運作功能或干擾他人使用本網站。<br>
                若您就本網站或網站內容的存取有違反或牴觸任何法令規定或本條款時，本公司將撤回您網站及網頁內容的權限。`,
                distribution: `付款及運送方式<br><br>
付款方式：<br>
貨到付款 , 提供 黑貓宅配貨到付款。<br>
運送方式及費用：<br>
宅配貨到付款, 免運費, 超區宅配, 300元運費<br>
註：以下區域需要NT$ 300 運費<br>
宜蘭縣-釣魚台列嶼(全)，高雄市-東沙(全)、南沙(全)，澎湖縣-馬公(虎井島、桶盤島)、望安(全)、七美(全)、白沙(大倉嶼、員貝嶼、鳥嶼、吉貝嶼)，金門縣-烈嶼(大膽島、二膽島)、烏坵(全)、台東縣-蘭嶼(全)<br>
本公司不保證您所接觸的網站或網頁內容的任何部分為正確、完整或可使用，或未來將持續維持正確、完整或可使用的狀態。本公司有權利但無義務，得隨時以任何理由或毋須理由，自行決定增加、變更、修改、刪除、限制或阻擋存取本網站或網頁內容的全部或部分。<br><br>
退換貨須知<br><br>
為保護消費者權益，商品皆享有7天鑑賞期。<br>
1. 瑕疵商品退換，請於7日內辦理退換貨，我們將會負擔全額退費＆運費。<br>
2. 非瑕疵商品退換，請於3日內辦理退換貨，將由買家自行負擔運費。<br>
3. 商品需保持完整包裝，無配戴及使用痕跡。<br>
退換貨方式<br>
步驟1：<br>
請務必登入訂單留言通訊處 ，告知退換貨商品，需附上「取件人姓名」及「產品照片」和退換原因，並提供您的可收貨地址或其他退貨方式。<br>
步驟2：<br>
換貨 / 等待貨運至指定地點，簽收並更換商品。<br>
退貨 / 我們目前提供 貨運宅配退貨<br>
1. 貨運收貨（流程約2-4天）：<br>
等待貨運至指定地點，請務必在貨件中附上您的匯款資料，收回退件以後我們會馬上安排退款。
`,
                privacy: `帳戶、密碼及安全<br><br>
1.使用本網站、網頁內容，可能會被要求提供完整且正確的個人資訊予本網站建立 帳戶專供您個人及非商業用途使用，您應提供完整詳實且符合真實之個人資料，如有任何虛假或冒用他人名義登錄，應自負法律責任。若您所登錄之資料事後有變更，並應隨時於線上更新。若您提供之個人資料有填寫不實，或所登錄之資料已不符合真實而未更新，本公司有權隨時終止您會員資格及使用各項服務之權利。<br>
2.對於您所取得的使用者名稱和密碼，您必須負妥善保管和保密的義務。如有任何您個人帳戶遭非法使用或有任何安全侵入情事，包括但不限於發生任何未經授權即擅用您個人帳戶之情形，您應立即通知本公司，惟本公司不負責因您個人帳戶未經授權使用所造成之任何損失。<br>
3.為包括但不限於創設使用者名稱與密碼，或選擇利用其他第三方網站所既有之帳號連結之方式為之，例如：Facebook、Googl….. （下稱「個人帳戶」），並同意本條款及應用程式之使用條款及隱私權政策。<br>
4.建立個人帳戶時需符合法定規定之年齡限制。<br>
5.若本公司判斷認為您可能從事非法或詐欺行為或其他犯罪行為，或您違反本條款之規定時，本公司除得行使法律所賦予的其他權利外，亦有權得拒絕提供您服務、關閉或暫停您個人帳戶或為其他行為，包括但不限於取消所有本公司賦予您的權利、利益或活動資格等或終止所有本公司與您之間的契約關係。<br><br>
隱私性<br><br>
Rosememary的隱私權政策適用於本網站之使用，其規定內容為本使用條款之一部。藉由使用本網站，您承認和同意網際網路傳輸是無法完全保密或安全的。您瞭解任何您寄發到本網站之消息或資訊，皆有可能被其他人閱讀或攔截，既便經通知特定傳輸已為編碼之資訊 (例如信用卡資訊)。<br><br>
第三方連結<br><br>
本網站得包含連接其他獨立第三方網站的連結，亦得允許您透過本網站連結至其他網站、服務或網路資源（「第三方連結」）。第三方連結僅係供您方便之用。該連結網站非由本公司所控制，且本公司就其內容不為背書亦不負任何責任，包括任何該連結網站之資訊或內容。就與該連結網站互動之事項，您應自行獨立判斷。<br><br>
聲明<br><br>
本網站及網頁內容係基於「現有狀態」及「現可使用狀態」進行傳輸，Rosememary不保證本網站或其內容、服務及特色商品無任何錯誤或不中斷，亦不保證所有瑕疵將被更正，或您對本網站的使用將有特定之結果。所有提供於本網站之資訊，將可能隨時不經通知而變更。不保證您自本網站下載之文件或其它資料可免於病毒、感染或不具破壞性。茲聲明並無任何明示或默示之保證，包括所有內容正確性、無侵害權利及就產品特定目的之銷售性及適用性之保證。<br>
本公司聲明對於任何與您使用本網站或服務有關之第三人行為或不行為，均不負任何責任。您對於使用本網站及連結網站應承擔所有責任。您對本網站或網頁內容不滿時，得向Rosememary主張的唯一救濟係停止使用本網站或網頁內容。Rosememary或任何Rosememary人員在任何情況下，均不對本網站或網頁內容為任何聲明或保證。
上述聲明適用於因任何債務不履行、錯誤、遺漏、中斷、刪除、瑕疵、運作或傳輸之延遲、電腦病毒、通信線路失敗，偷竊或破壞或未經授權而進入、變造及使用，不論是違約、侵權行為、過失或其它行為造成之損害、責任或傷害。<br>
上述聲明適用於您因使用或存取本網站、網頁內容及第三方連結有關的任何行為、不行為、債務不履行、錯誤、遺漏、中斷、刪除、瑕疵、運作或傳輸之遲延、惡意軟體、通信線路失敗、偷竊或第三方未經授權的存取、變造及使用，所致的任何及所有損害、責任或傷害。<br>
本公司保留在任何時候，得不經通知執行下列事項之權利:<br>
● 基於任何原因，修改、暫停或終止本網站或其任何部份之開放或運作。<br>
● 修改或變更本網站或其部份適用的政策或內容。<br>
● 於有必要為定期或非定期之維修，修改錯誤，或為其他變更時，中斷本網站或其部份之運作。
`,
                contact: `我們很高興收到您的反饋：<br><br>
Email： service@rosememary.com<br><br>
Line客服：http://line.me/ti/p/@025xtcwp<br><br>
我們的客服營業時間：週一至週日 09:00-18:00`
            }
        }
    },
    watch: {
        '$route': function (val) {
            this.type = val.params.type
        }
    },
    computed: {
        ...mapGetters(['site'])
    },
    mounted() {
        this.type = this.$route.params.type ? this.$route.params.type : 'us'
        this.comments.contact = this.site.content
    },
    activated() {
        this.type = this.$route.params.type
    },
    components: {
        WebHeader,
        WebFooter
    }
}
</script>

